&НаКлиенте
Процедура ТабличныеЗначенияОкладПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТабличныеЗначения.ТекущиеДанные;
	СтрокаТабличнойЧасти.НачисленоВсего = СтрокаТабличнойЧасти.Оклад * СтрокаТабличнойЧасти.ОтработаноЧасов;	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныеЗначенияОтработаноЧасовПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТабличныеЗначения.ТекущиеДанные;
	СтрокаТабличнойЧасти.НачисленоВсего = СтрокаТабличнойЧасти.Оклад * СтрокаТабличнойЧасти.ОтработаноЧасов;
КонецПроцедуры   

&НаКлиенте
Процедура ТабличныеЗначенияУдержаноНДФЛПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТабличныеЗначения.ТекущиеДанные;
    СтрокаТабличнойЧасти.СуммаКВыплате = СтрокаТабличнойЧасти.НачисленоВсего - СтрокаТабличнойЧасти.УдержаноНДФЛ;
КонецПроцедуры   

&НаКлиенте
Процедура ТабличныеЗначенияПриИзменении(Элемент)
Объект.ОтработаноЧасов = Объект.ТабличныеЗначения.Итог("ОтработаноЧасов");
Объект.НачисленоВсего = Объект.ТабличныеЗначения.Итог("НачисленоВсего");
Объект.УдержаноНДФЛ = Объект.ТабличныеЗначения.Итог("УдержаноНДФЛ");
Объект.СуммаКВыплате = Объект.ТабличныеЗначения.Итог("СуммаКВыплате");
КонецПроцедуры 









 
	



