&НаКлиенте
Процедура ТоварКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товар.ТекущиеДанные;
	СтрокаТабличнойЧасти.ОбщаяСтоимость = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.СуммаЗаЕд;
КонецПроцедуры

&НаКлиенте
Процедура ТоварСуммаЗаЕдПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товар.ТекущиеДанные;
	СтрокаТабличнойЧасти.ОбщаяСтоимость = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.СуммаЗаЕд;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.СуммаДокумента = Объект.Товар.Итог("ОбщаяСтоимость");
КонецПроцедуры


