
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.РасчетнаяВедомость.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетнаяВедомость.Дата,
	|	РасчетнаяВедомость.НачисленоВсего,
	|	РасчетнаяВедомость.Номер,
	|	РасчетнаяВедомость.ОтработаноЧасов,
	|	РасчетнаяВедомость.ОтчетныйПериодПо,
	|	РасчетнаяВедомость.ОтчетныйПериодС,
	|	РасчетнаяВедомость.СуммаКВыплате,
	|	РасчетнаяВедомость.УдержаноНДФЛ,
	|	РасчетнаяВедомость.ТабличныеЗначения.(
	|		НомерСтроки,
	|		ТабельныйНомер,
	|		ФИО,
	|		Должность,
	|		Оклад,
	|		ОтработаноЧасов,
	|		НачисленоВсего,
	|		УдержаноНДФЛ,
	|		СуммаКВыплате
	|	)
	|ИЗ
	|	Документ.РасчетнаяВедомость КАК РасчетнаяВедомость
	|ГДЕ
	|	РасчетнаяВедомость.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТабличныеЗначенияШапка = Макет.ПолучитьОбласть("ТабличныеЗначенияШапка");
	ОбластьТабличныеЗначения = Макет.ПолучитьОбласть("ТабличныеЗначения");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТабличныеЗначенияШапка);
		ВыборкаТабличныеЗначения = Выборка.ТабличныеЗначения.Выбрать();
		Пока ВыборкаТабличныеЗначения.Следующий() Цикл
			ОбластьТабличныеЗначения.Параметры.Заполнить(ВыборкаТабличныеЗначения);
			ТабДок.Вывести(ОбластьТабличныеЗначения, ВыборкаТабличныеЗначения.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
