
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ДоговорПоставки.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорПоставки.Банк,
	|	ДоговорПоставки.БИК,
	|	ДоговорПоставки.Дата,
	|	ДоговорПоставки.ИНН,
	|	ДоговорПоставки.КоррСчёт,
	|	ДоговорПоставки.КПП,
	|	ДоговорПоставки.МестоЗаключенияДоговора,
	|	ДоговорПоставки.НаименованиеОрганизации,
	|	ДоговорПоставки.Номер,
	|	ДоговорПоставки.РасСчёт,
	|	ДоговорПоставки.ФИОДействующегоЛицаОтОрганизации,
	|	ДоговорПоставки.ФИОДействующегоЛицаПоставщика,
	|	ДоговорПоставки.ЮрАдрес
	|ИЗ
	|	Документ.ДоговорПоставки КАК ДоговорПоставки
	|ГДЕ
	|	ДоговорПоставки.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
