
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда
		// Заполнение шапки
		Банк = ДанныеЗаполнения.Банк;
		БИК = ДанныеЗаполнения.БИК;
		ИНН = ДанныеЗаполнения.ИНН;
		КоррСчёт = ДанныеЗаполнения.КоррСчёт;
		КПП = ДанныеЗаполнения.КПП;
		РасСчёт = ДанныеЗаполнения.РасСчёт;
		НаименованиеОрганизации = ДанныеЗаполнения.Ссылка;
		ЮрАдрес = ДанныеЗаполнения.ЮрАдрес;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ДоговорПоставки") Тогда
		// Заполнение шапки
		Банк = ДанныеЗаполнения.Банк;
		БИК = ДанныеЗаполнения.БИК;
		ИНН = ДанныеЗаполнения.ИНН;
		КоррСчёт = ДанныеЗаполнения.КоррСчёт;
		КПП = ДанныеЗаполнения.КПП;
		РасСчёт = ДанныеЗаполнения.РасСчёт;
		НаименованиеОрганизации = ДанныеЗаполнения.СведенияОбОрганизации;
		ФИОДействующегоЛицаОтОрганизации = ДанныеЗаполнения.ФИОДействующегоЛицаОтОрганизации;
		ФИОДействующегоЛицаПоставщика = ДанныеЗаполнения.ФИОДействующегоЛицаПоставщика;
		ЮрАдрес = ДанныеЗаполнения.ЮрАдрес;
	КонецЕсли;
КонецПроцедуры
